In [1]:
import pandas as pd

## 예제 2-18 데이터 프레임 팬시검색

팬시검색 : 특정 레이블을 직접 리스트에 넣어서 검색하는 방식  
seaborn => 데이터 시각화 하려고 사용

In [2]:
import seaborn as sns

In [3]:
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [4]:
titanic.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

필터링 하고싶은 열을 직접 리스트에 입력

In [5]:
titanic[['age','sex','alive']].head()

    age     sex alive
0  22.0    male    no
1  38.0  female   yes
2  26.0  female   yes
3  35.0  female   yes
4  35.0    male    no

isnull() 결측치를 찾는 함수  
결측지 : 데이터가 없는(정의되지 않는) 값  
titanic[['age','sex','alive']] 열에 데이터가 없는 셀의 총합

In [6]:
titanic[['age','sex','alive']].isnull().sum()

age      177
sex        0
alive      0
dtype: int64

팬시검색을 하면 하나의 열도 데이터 프레임으로 반환

In [7]:
titanic[['age']].head()

    age
0  22.0
1  38.0
2  26.0
3  35.0
4  35.0

In [8]:
titanic['age'].head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

검색에 열 문자열만 입력하면 시리즈로 반환

In [9]:
titanic['age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [10]:
type(titanic['age'])

pandas.core.series.Series

## 예제 2-19 시리즈 팬시검색

In [11]:
titanic_age = titanic['age']
titanic_age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

시리즈 팬시검색은 원하는 인덱스 값의 행을 검색할 수 있다

In [12]:
titanic_age[[0,3,4]]

0    22.0
3    35.0
4    35.0
Name: age, dtype: float64